The staff of a service center for electrical appliances include three technicians who specialize in
repairing three widely used electrical appliances by three different manufacturers. It was desired
to study the effects of Technician and Manufacturer on the service time. Each technician was
randomly assigned five repair jobs on each manufacturer's appliance and the time to complete
each job (in minutes) was recorded. The data for this particular experiment is thus attached.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from statsmodels.formula.api import ols      # For n-way ANOVA
from statsmodels.stats.anova import _get_covariance,anova_lm # For n-way ANOVA
%matplotlib inline

In [2]:
df_1=pd.read_csv("Service (1) (1) (2) (1) (1).csv")

In [3]:
df_1.head()

   Technician  Manufacturer  Job  Service_Time
0           1             1    1            62
1           1             1    2            48
2           1             1    3            63
3           1             1    4            57
4           1             1    5            69

In [4]:
df_1

    Technician  Manufacturer  Job  Service_Time
0            1             1    1            62
1            1             1    2            48
2            1             1    3            63
3            1             1    4            57
4            1             1    5            69
5            1             2    1            57
6            1             2    2            45
7            1             2    3            39
8            1             2    4            54
9            1             2    5            44
10           1             3    1            59
11           1             3    2            53
12           1             3    3            67
13           1             3    4            66
14           1             3    5            47
15           2             1    1            51
16           2             1    2            57
17           2             1    3            45
18           2             1    4            50
19           2             1    5            39
20           2             2    1            61
21           2             2    2            58
22           2             2    3            70
23           2             2    4            66
24           2             2    5            51
25           2             3    1            55
26           2             3    2            58
27           2             3    3            50
28           2             3    4            69
29           2             3    5            49
30           3             1    1            59
31           3             1    2            65
32           3             1    3            55
33           3             1    4            52
34           3             1    5            70
35           3             2    1            58
36           3             2    2            63
37           3             2    3            70
38           3             2    4            53
39           3             2    5            60
40           3             3    1            47
41           3             3    2            56
42           3             3    3            51
43           3             3    4            44
44           3             3    5            50

In [5]:
df_1.shape

(45, 4)

In [6]:
df_1["Technician"].value_counts()

1    15
2    15
3    15
Name: Technician, dtype: int64

In [7]:
df_1["Manufacturer"].value_counts()

1    15
2    15
3    15
Name: Manufacturer, dtype: int64

In [8]:
df_1.shape

(45, 4)

In [9]:
df_1.describe()

       Technician  Manufacturer        Job  Service_Time
count   45.000000     45.000000  45.000000     45.000000
mean     2.000000      2.000000   3.000000     55.822222
std      0.825723      0.825723   1.430194      8.448477
min      1.000000      1.000000   1.000000     39.000000
25%      1.000000      1.000000   2.000000     50.000000
50%      2.000000      2.000000   3.000000     56.000000
75%      3.000000      3.000000   4.000000     62.000000
max      3.000000      3.000000   5.000000     70.000000

In [10]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Technician    45 non-null     int64
 1   Manufacturer  45 non-null     int64
 2   Job           45 non-null     int64
 3   Service_Time  45 non-null     int64
dtypes: int64(4)
memory usage: 1.5 KB

Need to convert categorical value for Technician and Manufacturer

In [11]:
DF.PriceLevel = pd.Categorical(DF.PriceLevel)

NameError: name 'DF' is not defined

In [ ]:
df_1.Technician=pd.Categorical(df_1.Technician)

In [ ]:
df_1.Manufacturer=pd.Categorical(df_1.Manufacturer)

In [ ]:
df_1.info()

1) State the Null and Alternate Hypothesis for conducting one-way ANOVA for both the
variables ‘Manufacturer’ and ‘Technician individually.

One Way ANOVA of Manufacturer

Ho:There is No significance difference between the Manufactures 
Ha:There is significance difference between the Manufactures

Ho:μ1=μ2=μ3
Ha:μ1<>μ2=μ3(One of the Mean is different)

One Way ANOVA of Technician

Ho:There is No significance difference between the Technician
Ha:There is significance difference between the Technician

Ho:μ1=μ2=μ3
Ha:μ1<>μ2=μ3(One of the Mean is different)

2) Perform one-way ANOVA for variable ‘Manufacturer’ with respect to the variable ‘Service
Time’. State whether the Null Hypothesis is accepted or rejected based on the ANOVA results.

Ho:There is No significance difference between the Manufactures 
Ha:There is significance difference between the Manufactures 

Ho:μ1=μ2=μ3
Ha:μ1<>μ2=μ3(One of the Mean is different)

2) Perform one-way ANOVA for variable ‘Manufacturer’ with respect to the variable ‘Service
Time’. State whether the Null Hypothesis is accepted or rejected based on the ANOVA results. -

In [ ]:
formula = 'Service_Time ~ C(Manufacturer)'
model = ols(formula, df_1).fit()
aov_table = anova_lm(model)
print(aov_table)

On performing One way Annova for Manufacturing with Respect to Service Time the Null Value has  around 80% acceptance rate,which Mean that we can prove the Null 
Hypothesis.So there is no significant difference between the Means in Manufactures

In [ ]:
formula = 'Service_Time ~ C(Technician)'
model = ols(formula, df_1).fit()
aov_table = anova_lm(model)
print(aov_table)

On performing One way Annova for Manufacturing with Respect to Service Time the Null Value has around 80% acceptance rate,which Mean that we can prove the Null Hypothesis.So there is no significant difference between the Means in Manufactures

In [ ]:
sns.pointplot(x='Manufacturer', y='Service_Time', data=df_1)

In [ ]:
sns.pointplot(x='Technician', y='Service_Time', data=df_1)

In [ ]:
sns.pointplot(x='Manufacturer', y='Service_Time', data=df_1, hue='Technician')

In [ ]:
sns.pointplot(x='Technician', y='Service_Time', data=df_1, hue='Manufacturer')

In [ ]:
formula = 'Service_Time~ C(Manufacturer)+C(Technician)'
model = ols(formula, df_1).fit()
aov_table = anova_lm(model)
print(aov_table)

In [ ]:
formula = 'Service_Time~ C(Manufacturer)+C(Technician)+ C(Manufacturer):C(Technician)'
model = ols(formula, df_1).fit()
aov_table = anova_lm(model)
print(aov_table)